{"id":107915,"xmlId":"Kunpeng Porting Advisor","name":"Kunpeng Porting Advisor","description":"\n      <h1>Kunpeng Porting Advisor Plugin</h1>\n      <p>The Kunpeng Porting Advisor Plugin automatically scans and analyzes the software to be ported and provides professional porting guidance.</p>\n      <ul>\n        <li>One-click deployment</li>\n        <br>\n        <p>You can download the plugin from the JetBrains Marketplace and install it online, and deploy the server environment by simply clicking the mouse.</p>\n        <br>\n        <li>Analysis and scanning</li>\n        <br>\n        <p>The plugin scans and analyzes software packages and source code files, and provides porting feasibility reports.</p>\n        <br>\n        <li>Code porting</li>\n        <br>\n        <p>The plugin analyzes the cross-platform compatibility of software source code, identifies the code to be ported, and provides porting guidance.</p>\n      </ul>\n      <h2>Introduction to the Kunpeng Porting Advisor</h2>\n      <p>The Kunpeng Porting Advisor functions as a client to call the functions of the server to complete scanning and porting tasks. It quickly scans and analyzes the software to be ported and provides professional code porting guidance, greatly simplifying the process of porting applications to the Kunpeng platform. This tool addresses the problems of heavy workload, low accuracy, and poor overall efficiency in manual analysis.</p>\n      <br>\n      <p>The Kunpeng Porting Advisor provides the following functions:</p>\n      <ul>\n        <li>Source code porting</li>\n        <br>\n        <p>The Kunpeng Porting Advisor can automatically check and analyze users' source code, C/C++ software build project files, link libraries used by C/C++ software build project files, and content that needs to be modified in x86 assembly code. It provides automatic code compatibility check, removes the dependency on manual expertise in code porting, and increases accuracy and efficiency in code compilation and debugging.</p>\n      </ul>\n      <h2>Disclaimer</h2>\n      <ol>\n        <li>This plugin is intended for enterprise users who need to use the plugin for work. You can use this plugin for work in compliance with laws, regulations, and government policies.</li>\n        <li>No individual or organization shall spread the plugin without the authorization of the plugin owner. You shall not delete the license information or other information in this plugin, or perform reverse engineering, disassembly, or decompilation on this plugin.</li>\n        <li>Unless otherwise specified in laws, regulations, or contracts, this plugin is provided \"AS IS\" without warranties, guarantees or representations of any kind, either expressed or implied.</li>\n        <li>This plugin is a beta version and is used only for the development and testing environment and open beta test (OBT). The feedback you obtain when you use this plugin is for reference only and does not constitute specific guidance or suggestions in any way or form.</li>\n        <li>You shall bear all risks arising from your use of this plugin. Huawei is not liable for any damage or loss of any nature in any case.</li>\n        <li>If you violate this disclaimer when using this plugin, Huawei is not liable for any consequences and does not assume any legal liabilities. If necessary, the responsible party will be held legally liable.</li>\n      </ol>\n    ","tags":["Plugin development"],"vendor":"Huawei Technologies Co., Ltd.","version":"2.2.5","dependencies":["Kunpeng Foundation","com.intellij.modules.platform","org.jetbrains.plugins.terminal"],"since":"201.0","size":14417416}