{"id":112737,"xmlId":"com.intellij.bigdatatools","name":"Big Data Tools","description":"\n    <p>\n      With this plugin, you can conveniently work with <b>Zeppelin</b> notebooks, monitor <b>Spark</b> and <b>Hadoop</b> applications,\n      and preview <a href=\"https://aws.amazon.com/s3/\">AWS S3</a>,\n      <a href=\"https://cloud.google.com/storage\">Google Cloud Storage</a>,\n      <a href=\"https://min.io/\">Minio</a>,\n      <a href=\"https://www.linode.com/\">Linode</a>,\n      <a href=\"https://www.digitalocean.com/products/spaces/\">Digital Open Space</a>,\n      <a href=\"https://azure.microsoft.com/en-us/\">Microsoft Azure</a>, and\n      <a href=\"https://hadoop.apache.org/docs/r1.2.1/hdfs_design.html\">Hadoop Distributed File System files</a> right from IntelliJ-based IDEs including\n      <b>IntelliJ IDEA Ultimate, PyCharm Professional, and DataGrip.</b>\n    </p>\n    <br>\n    <p>\n      For <b>Zeppelin</b> notebooks written in <b>Scala</b>, the plugin offers smart navigation, code completion, inspections &amp; quick-fixes,\n      and\n      refactorings inside the\n      notebooks. You can browse, create, and run Zeppelin notebooks without leaving the IDE.\n      If your <b>Zeppelin</b> server is using a <b>Spark</b> cluster, or you configured a Spark cluster separately in the plugin settings,\n      the plugin will allow you to track Spark jobs, see cluster environment and storage information from the IDE.\n      With <a href=\"https://github.com/JetBrains/ztools\">ZTools</a>, you can view details of the variables as you execute your notebooks,\n      and can get smart completion for data frame columns in SQL and Scala.\n    </p>\n    <br>\n    <p>You can also upload, download, and preview large structured files in tabular form, including CVS, Parquet, AVRO, and ORC formats.</p>\n    ","organization":"JetBrains s.r.o.","tags":["Tools integration"],"vendor":"JetBrains","version":"0.5.44","notes":"\n<h4>New features</h4>\n<ul>\n\t<li>Support for Zeppelin 0.9</li>\n\t<li>Ability to import and export Zeppelin notes</li>\n\t<li>Settings for Zeppelin interpreters and repositories</li>\n\t<li>Code insight for zeppelin.&lt;ClassName&gt;.precode</li>\n\t<li>New option in the Spark Submit Run Configuration: ability to run a custom script before the submit</li>\n\t<li>Improvements for PySpark builtins resolve</li>\n\t<li>Better configuration of Python dependencies and Python SDK in notes</li>\n\t<li>New feedback options and the feedback button in the BDT tool window</li>\n\t<li>Ability to discover Zeppelin notes using the IDE file search mechanism</li>\n</ul>\n\n<h4>Bug fixes</h4>\n<ul>\n\t<li>Allowed to set multiple configuration values using Spark Configuration / Properties List</li>\n\t<li>No more flickering while typing in Zeppelin notes</li>\n\t<li>Improved code completion in Zeppelin notes for SQL when ZTools is enabled</li>\n\t<li>Better displaying of table data in a note output</li>\n\t<li>Improved workflows for Zeppelin local notes</li>\n\t<li>Zeppelin actions `Run All Above`/`Run All Below` change their behavior in case of any errors during cell execution</li>\n\t<li>Zeppelin “Setup SDK” button works properly</li>\n\t<li>Improved appearance of charts in Zeppelin note outputs</li>\n\t<li>Fixed an exception in Azure on testing connection with invalid credentials</li>\n\t<li>A folder name in Azure can now have a trailing dot symbol</li>\n\t<li>The merge operation is performed when overwriting folders on HDFS</li>\n\t<li>No more exceptions in Spark Monitoring when disabling connections</li>\n\t<li>The SQL tab in Spark Monitoring is properly displayed for Spark v3.0.1</li>\n\t<li>Improved preview of CSV files</li>\n\t<li>Fixed copying notes from a Zeppelin server to the local file system</li>\n</ul>\n\n<h4>Minor changes</h4>\n<ul>\n\t<li>Ability to restart interpreters for a particular paragraph right from the gutter or editor context menu</li>\n\t<li>A Spark Monitoring configuration is per project if a Zeppelin connection is per project</li>\n\t<li>Optimized refresh of connections to remote file systems and Zeppelin servers</li>\n\t<li>Improved icons for Minio and Linode</li>\n\t<li>The Zeppelin `Interpreter Bindings` window now preserves size and position</li>\n\t<li>Changed background color for the note full-text search in the dark theme</li>\n\t<li>Ability to copy a note URL to the clipboard</li>\n</ul>\n<br>\n<p>The full release notes are available <a href=\"https://youtrack.jetbrains.com/issues?q=project:%20%7BBig%20Data%20IDE%7D%20Board%20BigDataTools:%20%7BGA%201.0%7D%20State:%20Fixed%20sort%20by:%20project,%20Type,%20votes%20\">here</a>.</p>\n","dependencies":["com.intellij.javafx","com.intellij.modules.ssh"],"optionalDependencies":["org.intellij.scala","org.jetbrains.kotlin","com.intellij.database","org.intellij.plugins.markdown","com.jetbrains.sh","Pythonid","com.jetbrains.plugins.webDeployment","com.intellij.java"],"since":"211.4961","until":"211.*","size":176129119}