{"id":115555,"xmlId":"com.virtuslab.git-machete","name":"Git Machete","description":"Probably the sharpest <b>git repository organizer</b> and <b>rebase/merge workflow automation</b> tool you've ever seen! <br><br>\n\nThis plugin adds an extra tab in the Git tool window that gives an instant answer to the questions:\n<ul>\n  <li>What are the branches in this repository?</li>\n  <li>What needs be merged/rebased/pushed/pulled?</li>\n</ul><br>\n\nThe <i>bird's eye view</i> provided by Git Machete makes <b>rebases/push/pulls hassle-free</b>\neven when <b>multiple branches</b> are present in the repository:\nmaster/develop, your topic branches, teammate's branches checked out for review etc. <br><br>\n\nAlong these lines, Git Machete helps create and maintain <b>small, focused, easy-to-review PRs</b>.<br><br>\n\nYou can read more at the <a href=\"https://github.com/VirtusLab/git-machete-intellij-plugin#git-machete-intellij-plugin\">plugin's GitHub repository</a>,\nas well as at the <a href=\"https://github.com/VirtusLab/git-machete#git-machete\">git-machete CLI GitHub repository</a>.\n","organization":"VirtusLab","tags":["Version Control"],"vendor":"VirtusLab","version":"0.9.1","notes":"<h3>v0.9.1</h3>\n\n<ul>\n  <li>Added support for IntelliJ 2021.1</li>\n  <li>Added dialog that suggests deleting local branches when sliding out</li>\n  <li>Added support for git config core.hooksPath property</li>\n  <li>Allowed slide out of currently checked out branch</li>\n  <li>Slide Out action slides out all occurrences of branch entry</li>\n  <li>Added slide out suggestion action link for the skipped branches to the skipped branches warning</li>\n  <li>Dropped external system - hackish approach to provide machete-file-to-graph-table synchronization</li>\n  <li>Added machete file changes listener - reasonable approach to provide machete-file-to-graph-table synchronization</li>\n</ul>\n<br>\n<br>\nImprovements:\n<ul>\n  <li>Add discover action to the toolbar</li>\n  <li>Do not show double-listed branches in graph table</li>\n  <li>Added tooltip for root branch as well as non-root branches</li>\n  <li>Enhance messages related to the ill-formed branch layout</li>\n</ul>\n<br>\n<br>\nBug fixes:\n<ul>\n  <li>Correctly check if Git Machete Tab is opened the project resolver (fixes premature discover)</li>\n  <li>Improve branch layout discover/write/backup reliability</li>\n</ul>\n","dependencies":["com.intellij.modules.lang","com.intellij.modules.platform","Git4Idea"],"since":"201.0","until":"211.*","sourceCodeUrl":"http://github.com/VirtusLab/git-machete-intellij-plugin","size":5245808}