{"id":70974,"xmlId":"com.ripstech.intellij","name":"RIPS Security Analysis","description":"\n    RIPS is a static code analysis software that automatically detects critical security issues in PHP/Java code with data flow analysis. It is available as local installation and as Software as a Service (SaaS) solution. With this plugin, you can start new security scans directly out of your IDE and review detected issues as soon as they are found.\n  ","tags":["Security","PHP"],"vendor":"RIPS Technologies","version":"2.2.3","notes":"\n    <ul>\n        <li>2.2.3 - Bugfix for unsupported filter when loading issues. </li>\n        <li>2.2.2 - Add option to open issue in RIPS web UI. Tweak UI. Fix of several bugs: no certificate manager for login, <br>\n            visual bug in tree, skipped issues when running new scan, fetching files too early, login button didn't disappear immediately.\n        </li><li>2.2.1 - Improved login error messages, fixed bug when switching projects, fixed login bug size.</li>\n        <li>2.2.0 - Add refresh application button, comment button and comment refresh button, additional issue information. <br>\n            Improvements to login window. Bug fixes. </li>\n        <li>2.1.1 - Minor improvements to UX. Fixed minor bugs.</li>\n        <li>2.1.0 - Added patch tab and comment button. Improved behavior of various UI components. New quick action: load latest scan.<br>\n            Better login behaviour. Support for version placeholders. Minor bug fixes.</li>\n        <li>2.0.0 - Added tracking of issues and better support for multi-module projects. Support for Java and PHP. <br>\n            Numerous UX and UI improvements as well as some minor bug fixes.</li>\n        <li>1.3.1 - Fix Integer overflows, fix files not being found, reduced JAR size.</li>\n        <li>1.3.0 - Added log window. UI improvements and bug fixes.</li>\n        <li>1.2.0 - Added basic support for multi-module projects. Additional UI tweaks, improvements, and bug fixes.</li>\n        <li>1.1.1 - Added additional configuration options. UI improvements.</li>\n        <li>1.1.0 - Use proxy settings. Added additional scan settings. Performance improvements when loading issues.</li>\n    </ul>\n    \n  ","dependencies":["com.intellij.modules.platform","Git4Idea"],"optionalDependencies":["com.intellij.modules.java","com.jetbrains.php"],"since":"181.3007.14","size":8746242}